app/views/my_threads/show.html.erb

SELECT `responses`.* FROM `responses` WHERE `responses`.`my_thread_id` = 1
---
  <ul>
    <%= @my_thread.responses.each do |response| %>