app/controllers/my_threads_controller.rb

SELECT `my_threads`.* FROM `my_threads`
---
  def index
    @my_threads = MyThread.all

INSERT INTO `my_threads` (`title`, `created_at`, `updated_at`) VALUES ('Jason1', '2017-05-18 08:38:21', '2017-05-18 08:38:21')
---
  def create
    @my_thread = MyThread.new(my_thread_params)

    respond_to do |format|
      if @my_thread.save

SELECT  `my_threads`.* FROM `my_threads` WHERE `my_threads`.`id` = 1 LIMIT 1
---
    def set_my_thread
      @my_thread = MyThread.find(params[:id])