app/controllers/responses_controller.rb

  def create
    @my_thread = MyThread.find(params[:my_thread_id])
    @response = @my_thread.responses.build(response_params)

    if @response.save
---
SELECT  `my_threads`.* FROM `my_threads` WHERE `my_threads`.`id` IS NULL LIMIT 1
INSERT INTO `responses` (`my_thread_id`, `content`, `created_at`, `updated_at`) VALUES (1, 'so strong!!', '2017-05-20 07:23:25', '2017-05-20 07:23:25')

  def edit
    @my_thread = MyThread.find(params[:my_thread_id])
    @response = @my_thread.responses.find(params[:id])
---
SELECT  `my_threads`.* FROM `my_threads` WHERE `my_threads`.`id` = 1 LIMIT 1
SELECT  `responses`.* FROM `responses` WHERE `responses`.`my_thread_id` = 1 AND `responses`.`id` = 1 LIMIT 1

  def update
    @my_thread = MyThread.find(params[:my_thread_id])
    @response = @my_thread.responses.find(params[:id])
    if @response.update(response_params)
---
SELECT  `my_threads`.* FROM `my_threads` WHERE `my_threads`.`id` = 1 LIMIT 1
SELECT  `responses`.* FROM `responses` WHERE `responses`.`my_thread_id` = 1 AND `responses`.`id` = 1 LIMIT 1
UPDATE `responses` SET `content` = 'so strong!', `updated_at` = '2017-05-20 08:23:39' WHERE `responses`.`id` = 1

  def destroy
    @my_thread = MyThread.find(params[:my_thread_id])
    @response = @my_thread.responses.find(params[:id])
    @response.destroy
---
SELECT  `my_threads`.* FROM `my_threads` WHERE `my_threads`.`id` = 1 LIMIT 1
SELECT  `responses`.* FROM `responses` WHERE `responses`.`my_thread_id` = 1 AND `responses`.`id` = 1 LIMIT 1
DELETE FROM `responses` WHERE `responses`.`id` = 1